app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" ORDER BY created_at DESC
---
  def index
    tag = Tag.order("created_at DESC")

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "school"], ["created_at", "2019-12-25 19:16:31.365745"], ["updated_at", "2019-12-25 19:16:31.365745"]]
---
  def create
    tag = Tag.create(tag_param)

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "tags" SET "name" = ?, "editable" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "testing"], ["editable", 0], ["updated_at", "2019-12-28 16:59:00.032840"], ["id", 9]]
---
  def update
    tag = Tag.find(params[:id])
    tag.update(tag_param)

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    tag = Tag.find(params[:id])
    tag.destroy