app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY created_at DESC
---
  def index
    todos = Todo.order("created_at DESC")

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "trying"], ["created_at", "2019-12-16 17:02:22.010143"], ["updated_at", "2019-12-16 17:02:22.010143"]]
---
  def create
    todo = Todo.create(todo_param)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "editable" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "updated"], ["editable", 0], ["updated_at", "2019-12-18 15:45:24.005632"], ["id", 14]]
---
  def update
    todo = Todo.find(params[:id])
    todo.update(todo_param)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tags_todos" WHERE "tags_todos"."todo_id" = ?  [["todo_id", 25]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 11]]
---
  def destroy
    todo = Todo.find(params[:id])
    todo.destroy