app/controllers/users_controller.rb

  def index
    users = User.order("created_at DESC")
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

  def create
    user = User.create(user_param)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sarah"], ["created_at", "2020-01-09 03:10:16.830651"], ["updated_at", "2020-01-09 03:10:16.830651"]]

  def update
    user = User.find(params[:id])
    user.update(user_param)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", ""], ["updated_at", "2020-01-09 03:13:44.463034"], ["id", 1]]